[
  {
    "abstract": "Despite recent cultural changes, the Early Music movement remains mostly a bastion of \"truth\" and \"authenticity\" in modern times' turbulent sea of doubt. Conversely, the whirlpool of artifice project wishes to legitimize a place for falsification, fiction and imagination in the realm of historically informed practice. The hermetic title A Whirlpool of Imaginary Sounds embeds in itself the main premises of the project. First, it alludes to Italian philosopher Giulio Camillo (1480-1544), who proposed a device called artificiosa routa, a generative model ante litteram to systematize the creative process of poets and orators. Analogously with Camillo and many transgressive thinkers of the 16th and early 17th century, the project wishes to investigate the plurality of worlds hidden behind the (re)combinations of a musical knowledge system.  Secondly, it is an homage to writers of fiction and thinkers like Jorge Luis Borges and Umberto Eco. Mythical creatures as well as utopian lands share a similar ascendant on our minds: through placing themselves outside reality they become powerful emblems revealing the inner meaning of things. Inspired by proto-scientific thought, poetry, devices of wonder and games from the 16th and early 17th centuries the Whirlpool of Imaginary Sounds aims to reconsider our past through polyphonic music that never was. In this project, I aspire to discover the liminal space between corpus-based musicking, forgery and period composition by reshaping the role of knowledge, either actual or imaginary, and its systematization.",
    "address": "Rome",
    "month": "May",
    "year": "2025",
    "author": "Cornia, Nicholas",
    "title": "A {{Praise}} of {{Falsehood}}: The {{Whirlpool}} of {{Imaginary Sounds}}",
    "type": "misc",
    "id": "corniaPraiseFalsehoodWhirlpool2025"
  },
  {
    "year": "2025",
    "author": "Nicholas Cornia and Nicholas Cornia and Viktor Lazarov",
    "journal": "AR@K \\textendash Artistic Research at Kristiania 2025",
    "title": "\\textquotedblleftEchos du temps pass{\\'e}\\textquotedblright: plurality, authority and taste in historical performance practice of the pre-Urtext era.",
    "type": "misc",
    "id": "Nicholas_Cornia_181075070"
  },
  {
    "year": "2024",
    "month": "nov",
    "author": "Cornia, Nicholas and Forment, Bruno",
    "booktitle": "International {Society} for {Music} {Information} {Retrieval} {Conference} ({ISMIR} 2024)",
    "language": "en",
    "abstract": "The meteoric surge of AI-generated music has prompted significant concerns among artists and publishers alike. Some fear that the adoption of AI is poised to result in massive job destruction; others sense it will jeopardize and eventually upend all legal frameworks of intellectual property. AI, however, is not the first instance where humanity has confronted the prospect of machines emulating musical creativity. Already in the Baroque, various modes of musical artificiality were explored, ranging from automata and organ stops mimicking human performance and natural sounds, up to devices for mechanized composition (e.g., Athanasius Kircher, Johann Philip Kirnberger, C.P.E. Bach, Antonio Calegari and Diederich Nickolaus Winkel). Valuable insights emerge from the reconsideration—and digital implementation—of these curiosities through the lens of present-day generative models. It can be argued that the very notion of ‘artificiality’ has presented humanity with long-standing philosophical dilemmas, in addressing the debate on the role of art as a substitute of (divine) nature. By digitally implementing and formalizing some pioneering instances of algorithmically-generated music we wish to illustrate how mechanical devices have played a role in human art and entertainment prior to our digital era.",
    "url": "https://ismir2024program.ismir.net/poster_212.html",
    "title": "{WHO}'{S} {AFRAID} {OF} {THE} `{ARTYFYSHALL} {BYRD}'? {HISTORICAL} {NOTIONS} {AND} {CURRENT} {CHALLENGES} {OF} {MUSICAL} {ARTIFICIALITY}",
    "address": "San Francisco, USA",
    "type": "inproceedings",
    "id": "cornia_whos_2024"
  },
  {
    "year": "2024",
    "month": "oct",
    "author": "Cornia, Nicholas",
    "language": "en",
    "abstract": "The performance of a musical work is a complex ecosystem, where performance practice, academic research and audience reception interact together. The critical analysis of sources related to a musical work is often a time-consuming and cumbersome task. Critical editions of music scores primarily focus on the composer’s agency, neglecting the contribution of a intricate network of agents, ranging from editors, conductors, amateur and professional performers.",
    "url": "https://www.uu.nl/en/research/interaction/second-international-conference-on-computational-and-cognitive-musicology",
    "title": "Flemish {Archive} for {Annotated} {Music} ({FAAM})",
    "type": "misc",
    "address": "Utrecht",
    "id": "cornia_flemish_2024"
  },
  {
    "year": "2024",
    "author": "Nicholas Cornia and Nicholas Cornia",
    "journal": "Research Catalogue",
    "title": "EXPLORING PLURALITY OF INTERPRETATION THROUGH ANNOTATIONS IN THE LONG 19TH CENTURY: MUSICIAN{'}S PERSPECTIVES AND THE FAAM PROJECT. ",
    "type": "misc",
    "id": "Nicholas_Cornia_163933638"
  },
  {
    "file": ":Cornia2021 - A Mannerist Fake Book_ a Case Study on Historical Popular Music in Italy (1520 1650).html:URL",
    "year": "2021",
    "title": "A Mannerist fake book -- A case study on Historical Popular music in Italy (1520-1650)",
    "school": "KASK School of Arts - HoGent",
    "author": "Nicholas Cornia",
    "type": "mastersthesis",
    "id": "Cornia2021"
  },
  {
    "year": "2019",
    "author": "Cornia, Nicholas",
    "title": "An analysis of Scott Joplin’s Treemonisha Overture and Gunther Schuller’s Transformation.",
    "type": "article",
    "id": "cornia2019analysis"
  },
  {
    "year": "2019",
    "author": "Cornia, Nicholas",
    "title": "Robert Franz and JS Bach’s cantatas: a study on 19th century performance practice of Baroque music.",
    "type": "article",
    "id": "cornia2019robert"
  },
  {
    "year": "2014",
    "pages": "35--42",
    "booktitle": "CI@ UAI",
    "author": "Cornia, Nicholas and Mooij, Joris M and others",
    "title": "Type-II Errors of Independence Tests Can Lead to Arbitrarily Large Errors in Estimated Causal Effects: An Illustrative Example.",
    "type": "inproceedings",
    "id": "cornia2014type"
  }
]